#pragma once

#include <vector>
#include <string>
#include <unordered_map>

#include "AnimatedImageData.h"
#include "SerializedPersonaPieceHandle.h"
#include "persona.h"
#include "TintMapColor.h"
#include "../../Core/Color.h"
#include "../../Core/mce.h"
#include "../../Core/json.h"
#include "../../dll.h"

class ConnectionRequest;
class SubClientConnectionRequest;
class ReadOnlyBinaryStream;
class BinaryStream;

class SerializedSkin {
public:
	enum class TrustedSkinFlag : int8_t {
		UNSET = 0,
		NO    = 1,
		YES   = 2,
	};

	// mFullId is always a concatenation of mId and mCapeId
	std::string mId, mFullId, mResourcePatch, mDefaultGeometryName; // 0x0, 0x20, 0x40, 0x60
	mce::Image mSkinImage, mCapeImage; // 0x80, 0xA0
	std::vector<AnimatedImageData> mSkinAnimatedImages; // 0xC0
	Json::Value mGeometryData, mGeometryDataMutable; // 0xD8, 0xE8
	std::string mAnimationData, mCapeId; // 0xF8, 0x118
	// premium skins are from skin packs or skins bought from the marketplace
	bool mIsPremium, mIsPersona, mIsPersonaCapeOnClassicSkin; // 0x138, 0x139, 0x13A
	std::vector<SerializedPersonaPieceHandle> mPersonaPieces; // 0x140
	// seems to be unused now, but it would be "slim" or "wide" for classic skins
	std::string mArmSize; // 0x158
	std::unordered_map<persona::PieceType, TintMapColor> mPieceTintColors; // 0x178
	Color mSkinColor; // 0x1B8
	TrustedSkinFlag mTrustedFlag; // 0x1C8 - mTrustedSkin

	MCAPI SerializedSkin();
	MCAPI SerializedSkin(SerializedSkin const &);
	MCAPI SerializedSkin(ConnectionRequest const &);
	MCAPI SerializedSkin(SubClientConnectionRequest const &);

	MCAPI SerializedSkin &operator=(SerializedSkin const &);

	MCAPI void read(ReadOnlyBinaryStream &);
	MCAPI void write(BinaryStream &);
	MCAPI void updateGeometryName();

	static inline constexpr const char *DEFAULT_SKIN_ID_PREFIX = "c18e65aa-7b21-4637-9b63-8ad63622ef01.Custom";
	static inline constexpr const char *STEVE_SKIN_ID          = "c18e65aa-7b21-4637-9b63-8ad63622ef01.Steve";
	static inline constexpr const char *ALEX_SKIN_ID           = "c18e65aa-7b21-4637-9b63-8ad63622ef01.Alex";
	static inline constexpr size_t DEFAULT_SKIN_SIZE_IN_BYTES_64x64 = 64 * 64 * 4; // 16384 for 64x64 skins
